{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 5 3 3\n",
      " 1 0 1\n",
      " 2 0 2\n",
      " 3 0 1\n",
      " 4 0 1\n",
      " 5 0 1\n",
      " 3 4\n",
      " 4 10\n",
      " 100 100\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "1\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Вам нужно реализовать алгоритм kNN — k Nearest Neighbours. На плоскости даны n\n",
    "# точек разбитые на 10 классов (какие-то классы могут быть пустыми). Алгоритм kNN\n",
    "# классифицирует произвольную точку (x,y) плоскости относя ее к одному из классов\n",
    "# следующим образом: рассматриваются k ближайщих к ней точек и класс (x,y) относится\n",
    "# к тому классу, который наиболее часто встречается среди этих k точек. (Если таких\n",
    "# классов несколько, то берется минимальный по номер класс).\n",
    "# Формат ввода\n",
    "# В первой строке даны 3 натуральных числа, разделенные пробелами, — \n",
    "# n,k,t. 1≤k≤n≤1000. 1≤t≤100.\n",
    "# На следующих n строчках заданы размеченные данные: в i-той строке 3 числа, разделенные\n",
    "# пробелами, xi,yi,ci — координаты i-той точки и метка ее класса. xi,yi — действительные\n",
    "# числа от −1000 до 1000, ci — натуральное число от 1 до 10.\n",
    "# Затем на следующих t строчках заданы тестовые данные: в i-той строке 2 числа, разделенные\n",
    "# пробелами, xi,yi — координаты i-той точки тестовых данных. xi,yi — действительные числа\n",
    "# от −1000 до 1000.\n",
    "# Формат вывода\n",
    "# Вывод вашей программы должен состоять из \n",
    "# t строк, в i-той строке, должно находиться одно единственное число — ci метка класса i-той\n",
    "# точки тестовых данных предсказанная с помощью kNN.\n",
    "# Пример\n",
    "# Ввод\n",
    "# 5 3 3\n",
    "# 1 0 1\n",
    "# 2 0 2\n",
    "# 3 0 1\n",
    "# 4 0 1 \n",
    "# 5 0 1\n",
    "# 3 4\n",
    "# 4 10\n",
    "# 100 100\n",
    "# Вывод\n",
    "# 1\n",
    "# 1\n",
    "# 1\n",
    "\n",
    "import sys\n",
    "\n",
    "first_str = input()\n",
    "aa = first_str.split(\" \")\n",
    "\n",
    "n = int(aa[0])\n",
    "k = int(aa[1])\n",
    "t = int(aa[2])\n",
    "\n",
    "data = []\n",
    "\n",
    "for i in range(0, n+t):\n",
    "    loc=input().split(\" \")\n",
    "    data.append(loc)\n",
    "\n",
    "train = []\n",
    "test = []\n",
    "\n",
    "for i in range(0, n):\n",
    "    train.append([float(data[i][0]),float(data[i][1]),float(data[i][2])])\n",
    "\n",
    "for i in range(n, n+t):\n",
    "    test.append([float(data[i][0]),float(data[i][1])])\n",
    "\n",
    "def euclideanDistance(point, train):\n",
    "    distance = []\n",
    "    for i in range(n):\n",
    "        distance.append([((train[i][0]-point[0])**2 + (train[i][1]-point[1])**2), train[i][2]])\n",
    "    return distance\n",
    "\n",
    "def searh_k_min_distances_ret_class(distances_data, num_neigbours):\n",
    "    sort_distances = sorted(distances_data)\n",
    "    short_data = sort_distances[:num_neigbours]\n",
    "    short_data\n",
    "    classes = []\n",
    "    for i in range(num_neigbours):\n",
    "        classes.append(short_data[i][1])  \n",
    "    return classes\n",
    "\n",
    "def one_class(classes):\n",
    "    classes = sorted(classes)\n",
    "    most_common = None\n",
    "    count_most_common = 0\n",
    "    for item in classes:\n",
    "        count = classes.count(item)\n",
    "        if count > count_most_common:\n",
    "            count_most_common = count \n",
    "            most_common = item\n",
    "    return int(most_common)\n",
    "\n",
    "answer = []\n",
    "for i in range(t):\n",
    "    distances = euclideanDistance(test[i], train)\n",
    "    classes = searh_k_min_distances_ret_class(distances,k)\n",
    "    class_point = one_class(classes)\n",
    "    answer.append(class_point)\n",
    "\n",
    "for item in answer:\n",
    "    print(str(item))\n",
    "    sys.stdout.flush()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
