{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Done!\n"
     ]
    }
   ],
   "source": [
    "# Для метеорологических исследований используется специальная переносная система сбора данных с датчика\n",
    "# температуры. В этой системе имеется аналоговый датчик температуры LM35, который имеет следующую спецификацию:\n",
    "# напряжение питания: от 2.7В до 5.5В;\n",
    "# разрешение: 10 мВ/∘C;\n",
    "# точность: ± 0.5∘C;\n",
    "# диапазон измерений: -55∘C to +150∘C (макс. +150∘C);\n",
    "# потребляемый ток: менее 50 мкА.\n",
    "# На выходе датчика формируется напряжение пропорционально температуре по шкале Цельсия, величина\n",
    "# напряжения 10.0 mV на 1∘C. При подключении датчика для повышения точности измерений используется\n",
    "# встроенное опорное напряжение 1.1 В. \n",
    "# При этом сама система выдает на выход количество измерений и последовательно по два показания для\n",
    "# дальнейшего анализа T – показания датчика температуры, S – расстояние от точки измерения до базовой\n",
    "# станции в метрах. Метеоролог снимает несколько показаний в разных точках и нажимает кнопку\n",
    "# “Проанализировать данные”. \n",
    "# Напишите программу, которая будет принимать показания датчика температуры и преобразовывать\n",
    "# представление этих показаний в виде градусов Цельсия, а в заключении выводить среднюю температуру\n",
    "# в точках на расстоянии Sk<N/2 от базовой станции и N – расстояние от самой удаленной точки измерения\n",
    "# от базовой станции. Точность вывода всех показаний температуры – до 2-го знака после запятой\n",
    "# (вещественное число), для среднего значения температуры на расстоянии N/2 – до 3-го знака после\n",
    "# запятой (вещественное число), N – целое число. \n",
    "# В качестве ответа загрузите исходный программный код.\n",
    "# Пример 1\n",
    "# Ввод\t\n",
    "# 4\n",
    "# 143.00\n",
    "# 1\n",
    "# 110.00\n",
    "# 5\n",
    "# 80.00 \n",
    "# 10\n",
    "# 70.00 \n",
    "# 15\n",
    "# Вывод\n",
    "# 15.89 12.22 8.89 7.78 14.056 15\n",
    "# Пример 2\n",
    "# Ввод\t\n",
    "# 6\n",
    "# 113.00\n",
    "# 23\n",
    "# 192.00 \n",
    "# 20\n",
    "# 450.00 \n",
    "# 1\n",
    "# 370.00 \n",
    "# 3\n",
    "# 150.00\n",
    "# 15\n",
    "# 199.00\n",
    "# 17\n",
    "# Вывод\n",
    "# 12.56 21.33 50.00 41.11 16.67 22.11 45.556 23\n",
    "\n",
    "f=open(\"input.txt\")\n",
    "stroka=f.read().split(\"\\n\")\n",
    "f.close()\n",
    "\n",
    "num = stroka[0]\n",
    "stroka = stroka[1:len(stroka)]\n",
    "\n",
    "temper = []\n",
    "distan = []\n",
    "\n",
    "for i in range(int(num)*2):\n",
    "    if((i+1)%2==0):\n",
    "        distan.append(float(stroka[i]))\n",
    "    else: temper.append(float(stroka[i]))\n",
    "\n",
    "ans_temp = [x * 0.11111888111888 for x in temper] \n",
    "max_d = max(distan)/2\n",
    "\n",
    "sum = 0\n",
    "n = 0\n",
    "for i in range(int(num)):\n",
    "    if(distan[i]<max_d):\n",
    "        sum += ans_temp[i]\n",
    "        n +=1 \n",
    "\n",
    "f=open(\"output.txt\",'w')\n",
    "f.write(\" \".join(\"{:.2f}\".format(i) for i in ans_temp))\n",
    "f.write(\" \" + \"{:.3f}\".format(sum/n) + \" \" + str(max(distan))) \n",
    "f.close()\n",
    "print(\"Done!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
